app/Controllers/CategoryController.php

SELECT COUNT(*) AS `numrows`
FROM `categories`
WHERE `thumbnail_url` = 'assets/1697325907_83387c0d416287f810de.jpg'
INSERT INTO `categories` (`name`, `thumbnail_url`) VALUES ('deuxime programme', 'assets/1697325907_83387c0d416287f810de.jpg')
---
    public function add()
    {
        $category = new CategoryModel();
        $validationRule = [
            'file' => [
                'rules' => [
                    'uploaded[file]',
                    'is_image[file]',
                    'mime_in[file,image/jpg,image/jpeg,image/gif,image/png,image/webp]',
                ],
            ],
        ];
        if (! $this->validate($validationRule)) {
            return redirect('category/create')->with('error', "Erreur lors de l'ajout de l'image. ");
        }
        if (!is_dir('./assets/categories/'))
            mkdir('./assets/categories/');
        $name = $this->request->getPost('name');
        $file = $this->request->getFile('file');
        $fname = $file->getRandomName();
        while (true) {
            $check = $category->where("thumbnail_url", "assets/categories/{$fname}")->countAllResults();
            if ($check > 0) {
                $fname = $file->getRandomName();
            } else {
                break;
            }
        }
        if ($file->move("assets/categories/", $fname)) {

            if ( $category->save([
                "name" => $name,
                "thumbnail_url" => "assets/categories/" . $fname
            ])) {

SELECT *
FROM `categories`
WHERE `categories`.`id` = '5'
DELETE FROM `categories`
WHERE `id` IN ('5')
---
    public function delete($id = null)
    {
        $category = new CategoryModel();
        $fileToDelete = $category->find($id);
        unlink($fileToDelete['thumbnail_url']);
        $category->delete($id);