app/Controllers/CoverController.php

    public function edit($id = null)
    {
        $cover = new CoverModel();

        $data['cover'] = $cover->find($id);
---
SELECT *
FROM `covers`
WHERE `covers`.`id` = '2'

    }
       } else {
        $title = $this->request->getPost('name');
        if (  $cover->update($id,[
            "title" => $title
        ])) {
---
UPDATE `covers` SET `title` = 'Test nouvelle banniere new 22222222222223333'
WHERE `covers`.`id` IN ('2')