app/Controllers/Home.php

SELECT *
FROM `covers`
---
    public function index()
    {
        $cover = new CoverModel();
        $data['covers'] =  $cover->findAll();

SELECT *
FROM `podcasts`
---
    public function podcast()
    {
        $podcast = new PodcastModel();

        $data['podcast'] = $podcast->findAll();

SELECT *
FROM `categories`
---
    public function category()
    {
        $category = new CategoryModel();
        $data['category'] =  $category->findAll();

SELECT *
FROM `categories`
SELECT *
FROM `items`
---
    public function item()
    {
        $item = new ItemModel();
        $category = new CategoryModel();
        $categories = $category->findAll();
        $array = array();

        foreach ($categories as $value){
            $array[$value['id']] = $value['name'];
        }
        $data['item'] =  $item->findAll();