app/Controllers/ItemController.php

    public function create()
    {
        $category = new CategoryModel();
        $data['category'] = $category->findAll();
---
SELECT *
FROM `categories`

    public function add()
    {
        if ($this->request->getPost('name') == null || $this->request->getPost('url') == null) {
            return redirect('item/create')->with('error', "Veuillez saisir au moins le nom et l'URL");
        }
        $item = new ItemModel();
        $data = [
            'name' => $this->request->getPost('name'),
            'url' => $this->request->getPost('url'),
            'description' => $this->request->getPost('description'),
            "categoryid" => $this->request->getPost('programme')
        ];

        if ($item->save($data)) {
---
INSERT INTO `items` (`name`, `url`, `description`, `categoryid`) VALUES ('Premiere video', 'https://www.youtube.com/watch?v=PrqSd9LMldo', 'Premiere video de la chaine', '6')

    public function edit($id = null)
    {
        $item = new ItemModel();
        $data['item'] = $item->find($id);

        $category = new CategoryModel();
        $data['category'] = $category->findAll();
---
SELECT *
FROM `items`
WHERE `items`.`id` = '4'
SELECT *
FROM `categories`