app/Controllers/UserController.php

SELECT *
FROM `users`
WHERE `email` = 'admin@admin.com'
---
  public function login()
  {
    $email = $this->request->getVar('email');
    $password = $this->request->getVar('password');

    $user = new UserModel();
    $data = $user->where('email', $email)->findAll();

    if ($data) {
      if (password_verify($password, $data[0]['password'])) {
        $this->session->set('login', 'logged');
        return redirect('/')->with('success', "Connexion réussie. Bienvenue, " . $data[0]['name']);
      } else {
        return redirect('user/loginPage')->with('error', "Email ou mot de passe incorrect.");